import time
class Admin(object):
    def printAdminView(self):
        print("*********************************************************************************************")
        print("*                                                                                           *")
        print("*                                                                                           *")
        print("*                                  欢迎登陆银行自动提款机系统                                 *")
        print("*                                                                                           *")
        print("*                                                                                           *")
        print("*********************************************************************************************")
        time.sleep(3)
    def printSysFunctionView(self):
        print("*********************************************************************************************")
        print("*               开户（1）                查询（2）                                            *")
        print("*               取款（3）                存款（4）                                            *")
        print("*               转账（5）                改密（6）                                            *")
        print("*               锁定（7）                解锁（8）                                            *")
        print("*               补卡（9）                销户（0）                                            *")
        print("*                            退出（t）                                                       *")
        print("*********************************************************************************************")
    def login(self):
        username = input("请输入管理员账号：")
        if username != "aaa":
            print("账号输入有误")
            return -1
        password = input("请输入管理员密码：")
        if password != "111":
            print("密码输入有误")
            return -1
        print("操作成功，请稍后。。。")
        time.sleep(3)
        return 0